#Область ПрограммныйИнтерфейс

// Возвращает параметры регистрации внешней обработки для подсистемы "Дополнительные отчеты и обработки"
//
// Возвращаемое значение:
//   Структура - см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке()
Функция СведенияОВнешнейОбработке() Экспорт
	Сведения = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	Сведения.Наименование = Метаданные().Синоним;
	Сведения.Версия =  "2.0.0.8";
	Сведения.Вид = "ДополнительнаяОбработка";
	ЗаполнитьЗначенияСвойств(Сведения.Команды.Добавить(),
		Новый Структура("Идентификатор, Представление, Использование",
		Метаданные().Имя, Метаданные().Представление(), "ОткрытиеФормы"));
	Возврат Сведения;
КонецФункции

#КонецОбласти