//  Подсистема "Модель текста"
//	Автор: Калякин Андрей Г.
//  https://github.com/KalyakinAG/kasl

Перем Строки Экспорт;
Перем СтрокаОтступа Экспорт;
Перем Уровень Экспорт;
Перем Комментирование;
Перем Экранирование;
Перем ИспользоватьОтступы;

Функция Шаблон(СтрокаШаблона, Знач П1 = Неопределено, Знач П2 = Неопределено, Знач П3 = Неопределено, Знач П4 = Неопределено, Знач П5 = Неопределено, Знач П6 = Неопределено, Знач П7 = Неопределено, Знач П8 = Неопределено, Знач П9 = Неопределено) Экспорт
	Если ТипЗнч(П1) = Тип("Массив") Тогда
		Параметры = П1;
		Колво = П1.Количество();
		Если Колво > 0 Тогда
			П1 = Параметры[0];
		КонецЕсли;
		Если Колво > 1 Тогда
			П2 = Параметры[1];
		КонецЕсли;
		Если Колво > 2 Тогда
			П3 = Параметры[2];
		КонецЕсли;
		Если Колво > 3 Тогда
			П4 = Параметры[3];
		КонецЕсли;
		Если Колво > 4 Тогда
			П5 = Параметры[4];
		КонецЕсли;
		Если Колво > 5 Тогда
			П6 = Параметры[5];
		КонецЕсли;
		Если Колво > 6 Тогда
			П7 = Параметры[6];
		КонецЕсли;
		Если Колво > 7 Тогда
			П8 = Параметры[7];
		КонецЕсли;
		Если Колво > 8 Тогда
			П9 = Параметры[8];
		КонецЕсли;
	КонецЕсли;
	Возврат СтрШаблон(СтрокаШаблона, П1, П2, П3, П4, П5, П6, П7, П8, П9);
КонецФункции

Функция Добавить(Текст = "", П1 = Неопределено, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено, П7 = Неопределено, П8 = Неопределено, П9 = Неопределено) Экспорт
	Если ПустаяСтрока(Текст) Тогда
		Строки.Добавить("");
		Возврат ЭтотОбъект;
	КонецЕсли;
	ШаблонТекста = Шаблон(Текст, П1, П2, П3, П4, П5, П6, П7, П8, П9);
	Если Экранирование Тогда
		ШаблонТекста = СтрЗаменить(ШаблонТекста, Символы.ПС, Символы.ПС + "|");
		ШаблонТекста = СтрЗаменить(ШаблонТекста, """", """""");
	КонецЕсли;
	СтрокиШаблона = СтрРазделить(ШаблонТекста, Символы.ПС);
	Отступ = ?(Комментирование, "//", "") + СтрокаОтступа;
	Для Каждого СтрокаШаблона Из СтрокиШаблона Цикл
		Строка = Отступ + СтрокаШаблона;
		Строки.Добавить(Строка);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

Функция Присоединить(Текст, П1 = Неопределено, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено, П7 = Неопределено, П8 = Неопределено, П9 = Неопределено) Экспорт
	СтрокиШаблона = СтрРазделить(Текст, Символы.ПС);
	ЭтоПерваяСтрока = Истина;
	Для Каждого СтрокаШаблона Из СтрокиШаблона Цикл
		Если ЭтоПерваяСтрока = Истина Тогда
			ИндексТекущейСтроки = Строки.ВГраница();
			Строки[ИндексТекущейСтроки] = Строки[ИндексТекущейСтроки] + Шаблон(СтрокаШаблона, П1, П2, П3, П4, П5, П6, П7, П8, П9);
			ЭтоПерваяСтрока = Ложь;
			Продолжить;
		КонецЕсли;
		Строка = СтрокаОтступа + Шаблон(СтрокаШаблона, П1, П2, П3, П4, П5, П6, П7, П8, П9);
		Строки.Добавить(Строка);
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

Функция Комментировать(Значение) Экспорт
	Комментирование = Значение;
	Возврат ЭтотОбъект;
КонецФункции

Функция Экранировать(Значение = Истина) Экспорт
	Экранирование = Значение;
	Возврат ЭтотОбъект;
КонецФункции

Функция Отступы(Значение) Экспорт
	ИспользоватьОтступы = Значение;
	Если ИспользоватьОтступы Тогда
		СтрокаОтступа = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символы.Таб, Уровень);
	Иначе
		СтрокаОтступа = "";
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции	

Функция Группировка(НовыйУровень) Экспорт
	Уровень = НовыйУровень;
	Если ИспользоватьОтступы Тогда
		СтрокаОтступа = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символы.Таб, Уровень);
	КонецЕсли;
	Возврат ЭтотОбъект;
КонецФункции	

Функция ГруппировкаНачать() Экспорт
	Группировка(Уровень + 1);
	Возврат ЭтотОбъект;
КонецФункции	

Функция ГруппировкаЗавершить() Экспорт
	Группировка(Уровень - 1);
	Возврат ЭтотОбъект;
КонецФункции

Функция ПолучитьТекст() Экспорт
	Возврат СтрСоединить(Строки, Символы.ПС);	
КонецФункции

Функция Текст() Экспорт
	Возврат СтрСоединить(Строки, Символы.ПС);	
КонецФункции

Функция Очистить() Экспорт
	Уровень = 0;
	СтрокаОтступа = "";
	Строки = Новый Массив;
	Возврат ЭтотОбъект;
КонецФункции

Комментирование = Ложь;
Экранирование = Ложь;
ИспользоватьОтступы = Истина;
Очистить();