//@skip-check module-structure-top-region

#Область KASL

//  Открывает форму объекта по ее имени. Решает проблему определения полного имени формы в зависимости от
//  объекта формы: внешняяя обработка, внутренняя обработка.
//  Параметры:
//    Форма - ФормаКлиентскогоПриложения - ЭтотОбъект: ВнешняяОбработка.ВнешняяОбработка1.Форма.Форма
//    ИмяФормы - Имя формы - "ФормаВвода"
//
Процедура ОткрытьФормуПоИмени(Форма, ИмяФормы, Параметры = Неопределено) Экспорт
	Позиция = СтрНайти(Форма.ИмяФормы, ".", НаправлениеПоиска.СКонца);
	ПолноеИмяФормы = Лев(Форма.ИмяФормы, Позиция) + ИмяФормы;
	ОткрытьФорму(ПолноеИмяФормы, Параметры, Форма);
КонецПроцедуры

#КонецОбласти // KASL