#Область ПрограммныйИнтерфейс

#Область ТерминальныеФункции

Функция НовыйМодельТекста() Экспорт
	
	МодельТекста = Новый Структура;
	МодельТекста.Вставить("Строки", Новый Массив);
	МодельТекста.Вставить("СтрокаОтступа", "");
	МодельТекста.Вставить("Уровень", 0);
	МодельТекста.Вставить("Комментирование", Ложь);
	Возврат МодельТекста;
		
КонецФункции

Функция Текст(МодельТекста) Экспорт
	Возврат СтрСоединить(МодельТекста.Строки, Символы.ПС);	
КонецФункции

#КонецОбласти

#Область Методы

Процедура Добавить(МодельТекста, Текст = "", П1 = Неопределено, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено, П7 = Неопределено, П8 = Неопределено, П9 = Неопределено) Экспорт
	Строки = МодельТекста.Строки;
	СтрокаОтступа = МодельТекста.СтрокаОтступа;
	Если ПустаяСтрока(Текст) Тогда
		Строки.Добавить("");
		Возврат;
	КонецЕсли;
	СтрокиШаблона = СтрРазделить(Текст, Символы.ПС);
	Для Каждого СтрокаШаблона Из СтрокиШаблона Цикл
		Строка = СтрокаОтступа + СтрШаблон(СтрокаШаблона, П1, П2, П3, П4, П5, П6, П7, П8, П9);
		Строки.Добавить(Строка);
	КонецЦикла;
КонецПроцедуры

Процедура Присоединить(МодельТекста, Текст, П1 = Неопределено, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено, П7 = Неопределено, П8 = Неопределено, П9 = Неопределено) Экспорт
	Строки = МодельТекста.Строки;
	СтрокаОтступа = МодельТекста.СтрокаОтступа;
	СтрокиШаблона = СтрРазделить(Текст, Символы.ПС);
	ЭтоПерваяСтрока = Истина;
	Для Каждого СтрокаШаблона Из СтрокиШаблона Цикл
		Если ЭтоПерваяСтрока = Истина Тогда
			ИндексТекущейСтроки = Строки.ВГраница();
			Строки[ИндексТекущейСтроки] = Строки[ИндексТекущейСтроки] + СтрШаблон(СтрокаШаблона, П1, П2, П3, П4, П5, П6, П7, П8, П9);
			ЭтоПерваяСтрока = Ложь;
			Продолжить;
		КонецЕсли;
		Строка = СтрокаОтступа + СтрШаблон(СтрокаШаблона, П1, П2, П3, П4, П5, П6, П7, П8, П9);
		Строки.Добавить(Строка);
	КонецЦикла;
КонецПроцедуры

// Группировка.
// 
// Параметры:
//  МодельТекста Модель текста
//  НовыйУровень Новый уровень
Процедура Группировка(МодельТекста, НовыйУровень) Экспорт
	МодельТекста.Уровень = НовыйУровень;
	МодельТекста.СтрокаОтступа = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символы.Таб, НовыйУровень);
КонецПроцедуры

Процедура ГруппировкаНачать(МодельТекста) Экспорт
	Группировка(МодельТекста, МодельТекста.Уровень + 1);
КонецПроцедуры

Процедура ГруппировкаЗавершить(МодельТекста) Экспорт
	Группировка(МодельТекста, МодельТекста.Уровень - 1);
КонецПроцедуры

Процедура Комментировать(МодельТекста, Значение = Истина) Экспорт
	МодельТекста.Комментирование = Значение;
КонецПроцедуры

Процедура Очистить(МодельТекста) Экспорт
	ЗаполнитьЗначенияСвойств(МодельТекста, НовыйМодельТекста());
КонецПроцедуры

#КонецОбласти

#КонецОбласти